[{"Title": "As Israel Attacked by Hamas, Oil Traders Are Focused on Iran", "Url": "https://finance.yahoo.com/news/israel-war-rages-oil-traders-095536214.html", "Source": "Yahoo Entertainment", "Content": "(Bloomberg) -- As oil traders prepare for the market to open after the sudden eruption of war in Israel, one question is key: will the conflict spread to the rest of the region? Most Read from Bloomberg Israel Latest: Over 1,100 Dead; US Sends Warships to Region Israel Latest: Army Reserves Called Up, Chevron Shuts Gas Field Oil Surges as Israel Conflict Reignites Middle East Volatility As Israel-Hamas War Rages, Oil Traders Focus on Iran Israelis Taken Hostage Were Ripped From Everyday Activities Crude traders don’t expect a massive price surge as there’s no immediate threat to supply. But all eyes are on Iran, a major oil producer and key backer of the Hamas group that launched this weekend’s offensive on Israel. A retaliatory strike against the Islamic Republic would inflame fears over the Strait of Hormuz, the vital shipping artery which Tehran has previously threatened to close. There’s also the prospect of the US cracking down again on a resurgent flow of Iranian oil exports. “Iran remains a very big wild card,” said Helima Croft, chief commodities strategist at RBC Capital Markets and a former CIA analyst. “Israel will escalate its long-running shadow war against Iran” and “what is unpredictable is how Iran would respond to such an intensification.” The risk of a wider conflict has emerged just as global crude supplies have been depleted by months of sharp production cutbacks by Saudi Arabia and Russia. Last month their supply constraints briefly pushed Brent futures to almost $100 a barrel. “It is unlikely to impact oil supply in the short term,” said hedge fund trader Pierre Andurand, founder of Andurand Capital Management LLP. “But it could eventually have an impact on supply and prices.” The onslaught comes almost exactly 50 years after the Arab oil embargo, when Saudi Arabia and other OPEC producers choked off flows to the west in the wake of the 1973 Yom Kippur War, which also involved Israel. READ: For Oil, It’s Not 1973. But It Could Still Get Ugly: Javier Blas No one expects Riyadh — which has been negotiating with Washington over normalizing relations with Israel — to turn off the taps in solidarity with the Palestinians now. At worst, the conflict may derail the normalization talks and scupper any additional Saudi oil flows that may have resulted. The energy minister of the United Arab Emirates, a key OPEC member, was clear on Sunday that the conflict wouldn’t affect the group’s decision-making. “We do not engage in politics; we govern by supply and demand, and we do not consider what each country has done,” Energy Minister Suhail Al Mazrouei told reporters in Riyadh. For its part, Iran, also an OPEC member, has expressed support for the Palestinian attack. Israel Latest: Fighting Extends to Second Day, Stocks Plunge If Israel responds by striking any Iranian infrastructure, “crude prices would immediately spike on the perceived risk of a disruption,” said Bob McNally, president of Rapidan Energy Group and a former White House official. For now, that looks unlikely, he said. Iranian oil has become increasingly important to the market as shipments have rebounded to a five-year high. That has come with Washington’s tacit blessing as the two sides have engaged in tentative diplomacy to re-establish limits on Tehran’s nuclear program. This weekend’s hostilities could prompt President Joe Biden’s administration to deal more aggressively with those cargo flows, which mostly go to China. “I think this development will mean stronger enforcement of Iranian sanctions, so less Iranian oil going forward,” said Andurand. “And then who knows what the domino effect will be in the region?” In a more extreme scenario, Iran could respond to any direct provocation by blocking the Strait of Hormuz, a nautical choke-point just north of the Arabian Sea. Tankers haul nearly 17 million barrels of crude and condensate each day through the waterway, which at its narrowest point is just 21 miles wide. Tehran threatened to close the strait when sanctions were imposed on the country in 2011, but ultimately backed off. The swelling tide of Iranian barrels has helped to moderate fuel prices this year while the Saudis and Vladimir Putin’s Russia squeeze supplies. The joint Riyadh-Moscow action is draining oil inventories at the fastest pace in years, installing a hefty price premium on prompt supplies known in the industry as backwardation. The “crude market is very tight” as “physical markets are screaming, with backwardation heading higher, dragging the flat price higher,”said Gary Ross, a veteran oil consultant turned hedge fund manager at Black Gold Investors LLC. Last week brought signs that the push toward $100 had gone too far, as Brent slumped 11% to just under $85 on the ICE Futures Europe exchange. Production cuts by the Saudis and Russia may have juiced prices too high, exacerbating jitters over the economy and bolstering the risk of higher interest rates. On the other hand, slashing output to about 9 million barrels a day has given Riyadh an immense buffer of spare production capacity that could be deployed if the current crisis leads to a disruption. The kingdom has about 3 million barrels day in reserve, and neighboring United Arab Emirates has another 1 million, according to Bloomberg estimates. That prodigious safety cushion of idle capacity is another reason traders don’t expect an immediate price surge when markets reopen. Still, the events may restore some of the geopolitical risk premium that had melted away in recent years. “The Hamas strike and Israeli response raises the geopolitical temperature,” said Richard Bronze, head of geopolitics at consultant Energy Aspects Ltd. --With assistance from Fahad Abuljadayel, Salma El Wardany and Anthony Di Paola. (Updates headline.) Most Read from Bloomberg Businessweek The Free-Money Experiment Is Over Can AI Beat the Market? Wall Street Is Desperate to Try Aftermath of an Assassination: Inside the India-Canada Crisis With Banks Offering 5% Returns, Financial Advisers Fight Irrelevance These 10 Graphics Show Just How Broken America’s Child-Care System Is ©2023 Bloomberg L.P. Related Quotes", "Summary": "Oil traders don’t expect a massive price surge as there’s no immediate threat to supply. All eyes are on Iran, a major oil producer and key backer of the Hamas group. A retaliatory strike against the Islamic Republic would inflame fears over the Strait of Hormuz. The risk of a wider conflict has emerged just as global crude supplies have been depleted by months of sharp production cutbacks by Saudi Arabia and Russia.“It is unlikely to impact oil supply in the short term,” said hedge fund trader Pierre Andurand. “But it could eventually have an impact on supply and prices.” The onslaught comes almost exactly 50 years after the Arab oil embargo in the wake of the 1973 Yom Kippur War, which also involved Israel."}, {"Title": "Majority of Americans — and even the majority of Republicans — support McCarthy's ouster", "Url": "https://www.politico.com/news/2023/10/08/poll-republicans-support-mccarthy-ouster-00120518", "Source": "Politico", "Content": "Congress  A CBS News poll found that 54% of Americans who identified as conservative expressed approval for booting McCarthy as speaker.  Former Speaker of the House Kevin McCarthy departs the office still bearing his nameplate after a day of meetings, at the Capitol in Washington, on Oct. 5, 2023. | J. Scott Applewhite/AP Photo  By POLITICO Staff  10/08/2023 11:44 AM EDT  Link Copied A new CBS News poll found that a majority of Americans support the House’s move to oust Kevin McCarthy (R-Calif.) as speaker, with 60% of adults in the U.S. backing the removal. The survey also noted that among those Americans who supported his ouster, 75% agreed with the sentiment that McCarthy wasn’t effective, an opinion that came after McCarthy cut a deal to avert a government shutdown last month, angering many of the members of the right flank of his party. Notably, 54% of Americans who identified as conservative expressed approval for ousting McCarthy, while 70% of Americans who called themselves liberals backed the move. Last Tuesday, Democrats joined with Rep. Matt Gaetz (R-Fla.) and his small group of conservative allies to vote to strip McCarthy of his gavel.  The development has thrust the House into a new era of chaos, especially with the specter of another government shutdown just weeks away. House Republicans are expected to meet this coming week to figure out a way forward. House Majority Leader Steve Scalise (R-La.) has officially announced he would pursue the speakership, while former President Donald Trump has endorsed Rep. Jim Jordan (R-Ohio), who also formally expressed his bid. It sets up a potentially messy battle to replace McCarthy, who has said he would not pursue another shot at the top job in the House. The CBS News poll included 2,155 adults in the U.S. and has a margin of error of plus or minus 2.9 percentage points. Link Copied  © 2023 POLITICO LLC", "Summary": "A new CBS News poll found that a majority of Americans support the House’s move to oust Kevin McCarthy (R-Calif.) as speaker. The survey also noted that among those Americans who supported his ouster, 75% agreed with the sentiment that McCarthy wasn’t effective. The development has thrust the House into a new era of chaos, especially with the specter of another government shutdown just weeks away. It sets up a potentially messy battle to replace McCarthy, who has said he would not pursue another shot at the top job in the House. The poll included 2,155 adults in the U.S. and has a margin of error of plus or minus 2.9 percentage points. It was conducted between October 5 and 8."}, {"Title": "Attack on Israel: What investors, economists, and strategists are saying about the effect on markets", "Url": "https://fortune.com/2023/10/08/attack-on-israel-effect-on-markets-according-to-investors-economists-strategists/", "Source": "Fortune", "Content": "Global financial markets already rattled by elevated interest rates now face a fresh dose of geopolitical uncertainty following Hamas’s surprise attack on Israel. Saturday’s strike and Israel’s subsequent declaration of war risk unnerving markets when they reopen Monday, with investors eyeing the reaction of the oil price as a guidepost, although crude traders aren’t anticipating an outsized surge. Sentiment toward stocks could take a hit with IG’s Weekend Wall Street contract down about 0.4% at noon on Sunday in London. Bond traders will need to quickly determine if the clash is a reason to rush for the safety of the dollar, shunning higher yielding-debt, or to fear yet another bout of inflation. The fallout in markets will likely be determined by whether conflict spreads to the rest of the Middle East region. Iran is both major oil producer and supporter of Hamas. “Geopolitical crises in the Middle East have usually caused oil prices to rise and stock prices to fall,” said Ed Yardeni, president of Yardeni Research Inc. “Much will depend on whether the crisis turns out to be another short-term flare-up or something much bigger like a war between Israel and Iran.” Here is a roundup of responses from investors, economists, traders and market strategists to the weekend’s news: “This will add more uncertainty to markets, with inflation and growth taking a step back and geopolitical risk taking center stage. We could expect a spike in volatility, with short-term fixed income becoming again a safe haven, while in cyclical sectors will be in the spotlight.” “Leaving aside the human drama, the consequences of all this should not be especially negative for the financial markets as long as the stability of the region and Iran’s violent expansionism in the field of security do not further complicate the conflict and it is limited to Palestinians and Israelis. “It is evident that any extension of this to oil-producing countries, Saudi Arabia in the lead, could make the price of crude oil more expensive with negative inflationary effects for the West and would mean higher rates for longer and falling stock markets if the above caused a recession.” “I don’t expect the situation to have a meaningful impact on markets. This is a long standing terrible situation but other than some short term volatility it shouldn’t have a big impact.” “The conflict has the potential to hurt broad market sentiment, but it’s not for certain. We think a lot will depend on whether the conflict is contained or widens in scope – for instance on Israel’s northern border – and that could prompt increased concerns about commodities – oil in particular. The oil price has been quite volatile in recent weeks, and another spike could feed into consumer prices in the coming months.” “The timing of the conflict could not have been worse given the talks between Saudi Arabia and Israel. A conflict in the Middle East has obvious implication in oil prices. Markets will worry about higher energy prices and since we are already in a risk-off environment, that could push equity markets lower.” “However, given where we are in the business cycle and already slowing global demand, the impact of the conflict would not be as severe as in the previous energy crisis in 1973 as we could potentially see more Saudi Arabian capacity coming into the market if needed to meet demand. Equity markets should see through this in terms of repricing risky assets but sentiment has the potential to stay subdued for longer as the market narrative shifts from soft landing to higher-for-longer and in the long run that would be bad for equity markets.” “The number one risk for the global economy is the possibility of a third inflation wave, just as the current one is petering out. The flaring of tensions in the Middle East could drive energy prices higher, and undermine the efforts of central banks to bring inflation under control. The geopolitical status quo has become increasingly unbalanced in the past few years, so outcomes from this new crisis could be more open-ended than markets may wish to believe.” “In the short term, we may see a bit of volatility, but when you step back and look company by company as to whether a regional conflict will effect their earnings power — in most cases the answer is no. It’s an unfortunate circumstance but will have little to no impact on aggregate earnings power.” “While the geopolitical set-up is very different to the early ‘70s in the region, there is a real risk that we see a strong reaction from Israel that will upset the Saudi-led negotiations and could see the US bolstering sanctions against Iran, which would see the oil price rise from here. Recent supply restrictions, low US strategic reserves and stronger-than-expected non-farm payroll numbers Friday suggest oil prices could breach 100 dollars a barrel and the recent escalation in tensions add further impetus to that narrative, which may result in a further near-term spike beyond that level.” “Financial markets will worry about the risk of higher oil prices pushing up global government bond yields. If the conflict widens across the region then oil supplies may be threatened. Any detente between Israel and Saudi Arabia and the potential for increased Saudi oil production will not be possible for either country to undertake if Israel and Palestinians are fighting. If Iran is perceived to be have spurred the hostilities in Gaza and southern Israel then the US is likely to tighten the enforcement of existing sanctions on Iran’s oil exports. All these factors would likely push oil prices up in the near term and therefore increase inflationary fears globally.” “I don’t expect a huge impact on European or US markets. The geopolitical risks are of course important depending on how the scale of the conflict evolves. Local stock markets are of course reacting to it but I don’t expect the same impact tomorrow. The only asset class one can look to for a possible reaction is oil but I don’t expect a big surge in prices given there is no impact on supply at the moment. One can’t compare the situation for oil with 1973. If the conflict was to take another dimension if for instance Israel were to directly hit Iranian infrastructure, it would be a whole different story but at the moment it is too early.” — With assistance by Eddie van der Walt, Isabelle Lee, Katherine Greifeld, and Julien Ponthus © 2023 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions.", "Summary": "Global financial markets already rattled by elevated interest rates now face a fresh dose of geopolitical uncertainty following Hamas’s surprise attack on Israel. Bond traders will need to quickly determine if the clash is a reason to rush for the safety of the dollar, shunning higher yielding-debt, or to fear yet another bout of inflation. The fallout in markets will likely be determined by whether conflict spreads to the rest of the Middle East region. “I don’t expect the situation to have a meaningful impact on markets. This is a long standing terrible situation but other than some short term volatility it shouldn't have a big impact,” said Ed Yardeni, president of YardenI Research Inc. The number one risk for the global economy is the possibility of a third inflation wave, just as the current one is petering out. The flaring of tensions in the Mideast could drive energy prices higher, and undermine efforts of central banks to bring inflation under control."}]