[{"Title": "As Israel Attacked by Hamas, Oil Traders Are Focused on Iran", "Url": "https://finance.yahoo.com/news/israel-war-rages-oil-traders-095536214.html", "Source": "Yahoo Entertainment", "Content": "(Bloomberg) -- As oil traders prepare for the market to open after the sudden eruption of war in Israel, one question is key: will the conflict spread to the rest of the region? Most Read from Bloomberg Israel Latest: Over 1,100 Dead; US Sends Warships to Region Israel Latest: Army Reserves Called Up, Chevron Shuts Gas Field Oil Surges as Israel Conflict Reignites Middle East Volatility As Israel-Hamas War Rages, Oil Traders Focus on Iran Israelis Taken Hostage Were Ripped From Everyday Activities Crude traders don’t expect a massive price surge as there’s no immediate threat to supply. But all eyes are on Iran, a major oil producer and key backer of the Hamas group that launched this weekend’s offensive on Israel. A retaliatory strike against the Islamic Republic would inflame fears over the Strait of Hormuz, the vital shipping artery which Tehran has previously threatened to close. There’s also the prospect of the US cracking down again on a resurgent flow of Iranian oil exports. “Iran remains a very big wild card,” said Helima Croft, chief commodities strategist at RBC Capital Markets and a former CIA analyst. “Israel will escalate its long-running shadow war against Iran” and “what is unpredictable is how Iran would respond to such an intensification.” The risk of a wider conflict has emerged just as global crude supplies have been depleted by months of sharp production cutbacks by Saudi Arabia and Russia. Last month their supply constraints briefly pushed Brent futures to almost $100 a barrel. “It is unlikely to impact oil supply in the short term,” said hedge fund trader Pierre Andurand, founder of Andurand Capital Management LLP. “But it could eventually have an impact on supply and prices.” The onslaught comes almost exactly 50 years after the Arab oil embargo, when Saudi Arabia and other OPEC producers choked off flows to the west in the wake of the 1973 Yom Kippur War, which also involved Israel. READ: For Oil, It’s Not 1973. But It Could Still Get Ugly: Javier Blas No one expects Riyadh — which has been negotiating with Washington over normalizing relations with Israel — to turn off the taps in solidarity with the Palestinians now. At worst, the conflict may derail the normalization talks and scupper any additional Saudi oil flows that may have resulted. The energy minister of the United Arab Emirates, a key OPEC member, was clear on Sunday that the conflict wouldn’t affect the group’s decision-making. “We do not engage in politics; we govern by supply and demand, and we do not consider what each country has done,” Energy Minister Suhail Al Mazrouei told reporters in Riyadh. For its part, Iran, also an OPEC member, has expressed support for the Palestinian attack. Israel Latest: Fighting Extends to Second Day, Stocks Plunge If Israel responds by striking any Iranian infrastructure, “crude prices would immediately spike on the perceived risk of a disruption,” said Bob McNally, president of Rapidan Energy Group and a former White House official. For now, that looks unlikely, he said. Iranian oil has become increasingly important to the market as shipments have rebounded to a five-year high. That has come with Washington’s tacit blessing as the two sides have engaged in tentative diplomacy to re-establish limits on Tehran’s nuclear program. This weekend’s hostilities could prompt President Joe Biden’s administration to deal more aggressively with those cargo flows, which mostly go to China. “I think this development will mean stronger enforcement of Iranian sanctions, so less Iranian oil going forward,” said Andurand. “And then who knows what the domino effect will be in the region?” In a more extreme scenario, Iran could respond to any direct provocation by blocking the Strait of Hormuz, a nautical choke-point just north of the Arabian Sea. Tankers haul nearly 17 million barrels of crude and condensate each day through the waterway, which at its narrowest point is just 21 miles wide. Tehran threatened to close the strait when sanctions were imposed on the country in 2011, but ultimately backed off. The swelling tide of Iranian barrels has helped to moderate fuel prices this year while the Saudis and Vladimir Putin’s Russia squeeze supplies. The joint Riyadh-Moscow action is draining oil inventories at the fastest pace in years, installing a hefty price premium on prompt supplies known in the industry as backwardation. The “crude market is very tight” as “physical markets are screaming, with backwardation heading higher, dragging the flat price higher,”said Gary Ross, a veteran oil consultant turned hedge fund manager at Black Gold Investors LLC. Last week brought signs that the push toward $100 had gone too far, as Brent slumped 11% to just under $85 on the ICE Futures Europe exchange. Production cuts by the Saudis and Russia may have juiced prices too high, exacerbating jitters over the economy and bolstering the risk of higher interest rates. On the other hand, slashing output to about 9 million barrels a day has given Riyadh an immense buffer of spare production capacity that could be deployed if the current crisis leads to a disruption. The kingdom has about 3 million barrels day in reserve, and neighboring United Arab Emirates has another 1 million, according to Bloomberg estimates. That prodigious safety cushion of idle capacity is another reason traders don’t expect an immediate price surge when markets reopen. Still, the events may restore some of the geopolitical risk premium that had melted away in recent years. “The Hamas strike and Israeli response raises the geopolitical temperature,” said Richard Bronze, head of geopolitics at consultant Energy Aspects Ltd. --With assistance from Fahad Abuljadayel, Salma El Wardany and Anthony Di Paola. (Updates headline.) Most Read from Bloomberg Businessweek The Free-Money Experiment Is Over Can AI Beat the Market? Wall Street Is Desperate to Try Aftermath of an Assassination: Inside the India-Canada Crisis With Banks Offering 5% Returns, Financial Advisers Fight Irrelevance These 10 Graphics Show Just How Broken America’s Child-Care System Is ©2023 Bloomberg L.P. Related Quotes", "Summary": "Oil traders don’t expect a massive price surge as there’s no immediate threat to supply. All eyes are on Iran, a major oil producer and key backer of the Hamas group. A retaliatory strike against the Islamic Republic would inflame fears over the Strait of Hormuz. The risk of a wider conflict has emerged just as global crude supplies have been depleted by months of sharp production cutbacks by Saudi Arabia and Russia.“It is unlikely to impact oil supply in the short term,” said hedge fund trader Pierre Andurand. “But it could eventually have an impact on supply and prices.” The onslaught comes almost exactly 50 years after the Arab oil embargo in the wake of the 1973 Yom Kippur War, which also involved Israel."}, {"Title": "Majority of Americans — and even the majority of Republicans — support McCarthy's ouster", "Url": "https://www.politico.com/news/2023/10/08/poll-republicans-support-mccarthy-ouster-00120518", "Source": "Politico", "Content": "Congress  A CBS News poll found that 54% of Americans who identified as conservative expressed approval for booting McCarthy as speaker.  Former Speaker of the House Kevin McCarthy departs the office still bearing his nameplate after a day of meetings, at the Capitol in Washington, on Oct. 5, 2023. | J. Scott Applewhite/AP Photo  By POLITICO Staff  10/08/2023 11:44 AM EDT  Link Copied A new CBS News poll found that a majority of Americans support the House’s move to oust Kevin McCarthy (R-Calif.) as speaker, with 60% of adults in the U.S. backing the removal. The survey also noted that among those Americans who supported his ouster, 75% agreed with the sentiment that McCarthy wasn’t effective, an opinion that came after McCarthy cut a deal to avert a government shutdown last month, angering many of the members of the right flank of his party. Notably, 54% of Americans who identified as conservative expressed approval for ousting McCarthy, while 70% of Americans who called themselves liberals backed the move. Last Tuesday, Democrats joined with Rep. Matt Gaetz (R-Fla.) and his small group of conservative allies to vote to strip McCarthy of his gavel.  The development has thrust the House into a new era of chaos, especially with the specter of another government shutdown just weeks away. House Republicans are expected to meet this coming week to figure out a way forward. House Majority Leader Steve Scalise (R-La.) has officially announced he would pursue the speakership, while former President Donald Trump has endorsed Rep. Jim Jordan (R-Ohio), who also formally expressed his bid. It sets up a potentially messy battle to replace McCarthy, who has said he would not pursue another shot at the top job in the House. The CBS News poll included 2,155 adults in the U.S. and has a margin of error of plus or minus 2.9 percentage points. Link Copied  © 2023 POLITICO LLC", "Summary": "A new CBS News poll found that a majority of Americans support the House’s move to oust Kevin McCarthy (R-Calif.) as speaker. The survey also noted that among those Americans who supported his ouster, 75% agreed with the sentiment that McCarthy wasn’t effective. The development has thrust the House into a new era of chaos, especially with the specter of another government shutdown just weeks away. It sets up a potentially messy battle to replace McCarthy, who has said he would not pursue another shot at the top job in the House. The poll included 2,155 adults in the U.S. and has a margin of error of plus or minus 2.9 percentage points. It was conducted between October 5 and 8."}, {"Title": "Israel latest: Stocks sink across Mideast, U.S. considers more military aid, more than 600 Israelis dead", "Url": "https://fortune.com/2023/10/08/israel-attack-latest-stocks-sink-mideast-us-military-aid-600-israelis-dead/", "Source": "Fortune", "Content": "Updated on October 8, 2023 at 5:45 PM ET The combined death toll from the Hamas attack on southern Israel has climbed to more than 1,100 as fighting headed into a third day. The US said it’s moving a six-vessel aircraft carrier strike group to the eastern Mediterranean and is augmenting its fighter aircraft squadrons in the region. More than 700 Israelis, most of them civilians, were killed in the attacks which erupted outside the Gaza Strip on Saturday morning. About 400 Palestinians have died in fighting and retaliatory attacks, as the Israeli military regained control over most areas breached by militants. The operation by Hamas — which included taking scores of Israeli hostages — was an unprecedented incursion that has shaken regional stability and markets. Israel officially declared war and says it won’t stop until Hamas’s military infrastructure is dismantled, a task that seems likely to include a ground invasion and take months. All time stamps Israel. “A good number of countries” condemned the Hamas attacks during a closed session of the UN Security Council, Ambassador Robert Wood of the US said. “Obviously not all. I don’t really want to get into that. I think you could probably figure out one of them without me saying anything.” Ambassador Lana Nusseibeh of the UAE said the immediate concern is the safe and unconditional return of hostages; broader political discussions aimed at a possible two-state solution can be addressed later. Iranian security officials helped Hamas plan its attack on Israel in a series of meetings over months, the Wall Street Journal reported, citing unnamed senior members of Hamas and Hezbollah, the Shiite militant group and political faction in Lebanon. The Journal said Hamas was given the “green light” for the attack in Beirut last Monday. US officials have noted Iran’s longstanding support for Hamas, with money and weapons. But US Secretary of State Antony Blinken said on Sunday the US hasn’t “yet seen direct evidence that Iran was behind this particular attack.” The dollar climbed against its major peers in early trading on Monday as currency traders got their first chance to react to a shock attack by Hamas within Israel. The greenback — long regarded as a haven in times of trouble — rose versus the euro and pound as trading began in Sydney, while riskier currencies including its Australian counterpart slipped. The yen — another favored refuge for investors — rallied. Riyad Mansour, the Palestinian observer at the United Nations, took a defiant tone in comments to reporters ahead of a special Security Council session, saying his people had repeatedly warned the Security Council about “the consequences of Israeli impunity and international inaction.” “We know only too well that the messages about Israel’s right to defend itself will be interpreted by Israel as license to kill, to pursue on the very path that led us here,” Mansour said. Palestinian Islamic Jihad is holding more than 30 Israeli hostages that will not be freed until all Islamic Jihad prisoners in Israel are also freed, the group’s leader, Ziad Al-Nakhala, said in a televised address. Israel’s ambassador to the UN, Gilad Erdan, said “every inch of Gaza has become part of Hamas’ war machine,” vowing that his country would “obliterate” all of the group’s terror infrastructure. Despite the violence, Israel is sticking to efforts to normalize relations with Saudi Arabia, he said, charging that suspending that bid would only benefit Iran. “There are moderate countries in our region that want to normalize relations and live in peace and coexistence, and definitely Saudi Arabia is part of them,” he said, speaking to reporters before a closed-door session of the UN Security Council on the issue. At least four American citizens were killed in the attacks on Israel, the Associated Press reported, citing preliminary reports from an unnamed US official. A six-vessel US naval group including the USS Gerald R. Ford aircraft carrier is headed to the eastern Mediterranean to “bolster regional deterrence efforts,” Defense Secretary Lloyd Austin said in a statement. Additional US equipment and resources, including munitions, will arrive in the coming days, he said. President Joe Biden and Prime Minister Benjamin Netanyahu spoke by phone for the second time in two days. Biden told Netanyahu during the call that additional military assistance for Israel “is now on its way,” according to a White House statement. Turkish President Recep Tayyip Erdogan reiterated his call for the establishment of an independent Palestinian state within 1967 borders, with Jerusalem as its capital. “The basis of the problems in our region today is the Palestine issue. Unless the issue is resolved, the region will long for peace,” Erdogan said in Istanbul on Sunday, “It is important to preserve the two-state solution.” Israeli Defense Minister Yoav Gallant instructed officials to prepare for the evacuation of civilians from communities in the country’s north. The program would be similar to evacuations that have taken place in more than 20 communities adjacent to the Gaza Strip. US Secretary of State Antony Blinken said the US is “working very actively” to verify reports that “several Americans” are among the dead. “At the same time, there are reports of Americans being taken hostage. There too, we’re working to get the facts and find out if those reports are accurate,” he said on CBS’s Face the Nation. Netanyahu spoke with German Chancellor Olaf Scholz, Ukrainian President Volodymyr Zelenskiy, Italian Prime Minister Giorgia Meloni and British Prime Minister Rishi Sunak on Sunday. All four expressed unreserved support for Israel’s right to defend itself, Netanyahu said. Iran’s President Ebrahim Raisi spoke with leaders of the militant groups Hamas and Islamic Jihad and “reviewed the situation underway in the occupied lands,” the state-run Islamic Republic News Agency said. Muslim governments should support the Palestinian people, Raisi said. “The hostile Israelis should know the equations have changed. Iran supports the legitimate defense of the Palestinian people.” While Israel has said it suspects Iran is involved, Tehran has not explicitly said it aided the attacks. Blinken has said there’s no immediate evidence Iran directed the attack.Link — With assistance by Stuart Wallace, Natalia Drozdiak, Dana Khraiche, Ethan Bronner, Gwen Ackerman, Fadwa Hodali, Tony Czuczka, Susanne Barton, Selcan Hacaoglu, Arsalan Shahla, Marie Patino, Albertina Torsoli, Victoria Cavaliere, Galit Altstein, Gregory White, and Courtney McBride  © 2023 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions.", "Summary": "More than 700 Israelis, most of them civilians, were killed in the attacks which erupted outside the Gaza Strip on Saturday morning. A six-vessel US naval group including the USS Gerald R. Ford aircraft carrier is headed to the eastern Mediterranean to “bolster regional deterrence efforts,” Defense Secretary Lloyd Austin said. Palestinian Islamic Jihad is holding more than 30 Israeli hostages that will not be freed until all Islamic Jihad prisoners in Israel are also freed, the group’s leader, Ziad Al-Nakhala, said in a televised address. Iranian security officials helped Hamas plan its attack on Israel in a series of meetings over months, the Wall Street Journal reported, citing unnamed senior members of Hamas and Hezbollah, the Shiite militant group and political faction in Lebanon."}]