[{"Title": "Samsung Galaxy Tab A9+ specifications leak, revealing 90Hz screen - SamMobile", "Url": "https://www.sammobile.com/news/samsung-galaxy-tab-a9-plus-specifications-images-leak-90hz-screen/", "Source": "SamMobile", "Content": "© 2023 SamMobile   SamMobile has affiliate and sponsored partnerships. If you buy something through one of these links, we may earn a commission.  Last updated: October 8th, 2023 at 14:47 UTC+02:00  Last week, Samsung unveiled the Galaxy Tab S9 FE and the Galaxy Tab S9 FE+, but the company isn't done launching tablets yet. The South Korean firm is almost ready to launch two more affordable tablets and this time, they will be even more affordable than the Galaxy Tab S9 FE lineup. After the specifications of the Galaxy Tab A9 were leaked a couple of days ago, the Galaxy Tab A9+ specifications have been revealed. Galaxy Tab A9+ specifications The unannounced Galaxy Tab A9+ has been listed on Amazon's website in the UAE. So, we now get to see the tablet's images and specifications. According to the listing (via MySmartPrice) and confirmation from WinFuture, the Galaxy Tab A9+ has an 11-inch IPS LCD screen with Full HD+ (1,920 x 1,200 pixels) resolution and a 90Hz refresh rate. This is the first Galaxy Tab A series tablet to feature a high-refresh-rate screen, and this is good to see. The tablet is equipped with the Snapdragon 695 processor, 4GB/8GB RAM, and 64GB/128GB internal storage. There is a microSD card slot for storage expansion. It is powered by a 7,040mAh battery and supports 15W fast charging. It comes in Wi-Fi-only (SM-X210) and Wi-Fi + 5G (SM-X215) variants. It isn't clear whether the tablet has a fingerprint reader. It has Bluetooth 5.2, GPS, and a USB Type-C port as well. Galaxy Tab A9+ price Samsung has equipped the Galaxy Tab A9+ with an 8MP front-facing camera and an 8MP rear-facing camera. The tablet will be available in dark blue and gray colors. According to the report, the Wi-Fi-only version of the tablet will be priced at €220, while the 5G version will be priced at €260.  After the specifications of the Galaxy Tab A9 were leaked a couple of days ago, the Galaxy Tab A9+ specifications have been revealed. Galaxy Tab A9+ specifications The unannounced Galaxy Tab A9+ has been listed on Amazon's website in the UAE. So, we now get to see the tablet's images and specifications. According to the listing (via MySmartPrice) and confirmation from WinFuture, the Galaxy Tab A9+ has an 11-inch IPS LCD screen with Full HD+ (1,920 x 1,200 pixels) resolution and a 90Hz refresh rate. This is the first Galaxy Tab A series tablet to feature a high-refresh-rate screen, and this is good to see. The tablet is equipped with the Snapdragon 695 processor, 4GB/8GB RAM, and 64GB/128GB internal storage. There is a microSD card slot for storage expansion. It is powered by a 7,040mAh battery and supports 15W fast charging. It comes in Wi-Fi-only (SM-X210) and Wi-Fi + 5G (SM-X215) variants. It isn't clear whether the tablet has a fingerprint reader. It has Bluetooth 5.2, GPS, and a USB Type-C port as well. Galaxy Tab A9+ price Samsung has equipped the Galaxy Tab A9+ with an 8MP front-facing camera and an 8MP rear-facing camera. The tablet will be available in dark blue and gray colors. According to the report, the Wi-Fi-only version of the tablet will be priced at €220, while the 5G version will be priced at €260.  The unannounced Galaxy Tab A9+ has been listed on Amazon's website in the UAE. So, we now get to see the tablet's images and specifications. According to the listing (via MySmartPrice) and confirmation from WinFuture, the Galaxy Tab A9+ has an 11-inch IPS LCD screen with Full HD+ (1,920 x 1,200 pixels) resolution and a 90Hz refresh rate. This is the first Galaxy Tab A series tablet to feature a high-refresh-rate screen, and this is good to see. The tablet is equipped with the Snapdragon 695 processor, 4GB/8GB RAM, and 64GB/128GB internal storage. There is a microSD card slot for storage expansion. It is powered by a 7,040mAh battery and supports 15W fast charging. It comes in Wi-Fi-only (SM-X210) and Wi-Fi + 5G (SM-X215) variants. It isn't clear whether the tablet has a fingerprint reader. It has Bluetooth 5.2, GPS, and a USB Type-C port as well. Galaxy Tab A9+ price Samsung has equipped the Galaxy Tab A9+ with an 8MP front-facing camera and an 8MP rear-facing camera. The tablet will be available in dark blue and gray colors. According to the report, the Wi-Fi-only version of the tablet will be priced at €220, while the 5G version will be priced at €260.  The tablet is equipped with the Snapdragon 695 processor, 4GB/8GB RAM, and 64GB/128GB internal storage. There is a microSD card slot for storage expansion. It is powered by a 7,040mAh battery and supports 15W fast charging. It comes in Wi-Fi-only (SM-X210) and Wi-Fi + 5G (SM-X215) variants. It isn't clear whether the tablet has a fingerprint reader. It has Bluetooth 5.2, GPS, and a USB Type-C port as well. Galaxy Tab A9+ price Samsung has equipped the Galaxy Tab A9+ with an 8MP front-facing camera and an 8MP rear-facing camera. The tablet will be available in dark blue and gray colors. According to the report, the Wi-Fi-only version of the tablet will be priced at €220, while the 5G version will be priced at €260.  Samsung has equipped the Galaxy Tab A9+ with an 8MP front-facing camera and an 8MP rear-facing camera. The tablet will be available in dark blue and gray colors. According to the report, the Wi-Fi-only version of the tablet will be priced at €220, while the 5G version will be priced at €260.  You might also like Samsung is about to launch four relatively affordable tablets, and two of them are in the Galaxy Tab A series. The Galaxy Tab A9 and the Galaxy Tab A9+ will succeed the Galaxy Tab A7 Lite and the Galaxy Tab A8 10.5, respectively. Now, some Galaxy Tab A9+ specifications have leaked. The Galaxy Tab A9+ […] Samsung is readying four more tablets after launching three high-end tablets a few weeks ago. Among those four upcoming tablets, two tablets are Galaxy Tab A series devices, while the other two are Galaxy Tab S9 FE series devices. The Galaxy Tab A9 and the Galaxy Tab A9+ could launch soon as they've passed another […] Last month, we got to know that Samsung is developing two new Galaxy Tab A-series tablets: Galaxy Tab A9 and Galaxy Tab A9+. These tablets are expected to succeed the Galaxy Tab A8 8-inch (2019) and the Galaxy Tab A8 10.5-inch (2021), respectively. Samsung accidentally confirmed the existence of the two tablets through support pages […] Samsung's upcoming Galaxy Tab A9 and Tab A9+ tablets seem to be getting closer to release. The company is going through the motions of approving the two tablets before their eventual debut, and to top it all off, a support page for the Galaxy Tab A9 is now live on one of Samsung's official portals. […] Samsung launched many new products a few days ago during its Galaxy Unpacked 2023 (Part 2) event. However, the company may not be done yet. We know it is planning to launch a few new tablets and accessories, including wireless earbuds and an object location tracker. Now, it is rumored that the company could launch […] Best picks Devices Samsung Galaxy A14 5G SM-A146B Samsung Galaxy S23 FE SM-S711U Samsung Galaxy Tab S9 FE SM-X510 Samsung Galaxy Tab S9 FE 5G SM-X516B Samsung Galaxy Tab S9 FE+ SM-X610 Samsung Galaxy Tab S9 FE+ 5G SM-X616B Samsung Galaxy Buds FE SM-R400 Samsung Galaxy Z Flip 5 SM-F731B September 2023 security patch Social media Reviews Notebook TV © 2023 SamMobile", "Summary": "The unannounced Galaxy Tab A9+ has been listed on Amazon's website in the UAE. According to the listing (via MySmartPrice) and confirmation from WinFuture, the tablet has an 11-inch IPS LCD screen with Full HD+ (1,920 x 1,200 pixels) resolution and a 90Hz refresh rate. The tablet is equipped with the Snapdragon 695 processor, 4GB/8GB RAM, and 64GB/128GB internal storage. It is powered by a 7,040mAh battery and supports 15W fast charging. The Wi-Fi-only version of the tablet will be priced at €220, while the 5G version will bepriced at €260. It isn't clear whether the device has a fingerprint reader."}, {"Title": "NFL Week 5 London game live tracker: Jaguars face tougher task as Bills travel to England", "Url": "https://sports.yahoo.com/nfl-week-5-london-game-live-tracker-jaguars-face-tougher-task-as-bills-travel-to-england-120558239.html", "Source": "Yahoo Entertainment", "Content": "For at least one week, the Jacksonville Jaguars are the toast of London. Following an impressive win over the Atlanta Falcons in Week 4, the Jaguars celebrated overseas and remained in England ahead of their next game. Things might not be so easy this time around, however, as the powerhouse Buffalo Bills are next up. After looking rocky on opening night, the Bills and quarterback Josh Allen have performed like everyone expected. Buffalo is riding a three-game winning streak entering Week 5 and are coming off a dominant 28-point win over the Miami Dolphins in Week 4. Follow along as Yahoo Sports provides the latest news, scores and injuries as the Bills take on the Jaguars in London.", "Summary": "The Jacksonville Jaguars are the toast of London after a win over the Atlanta Falcons in Week 4. The Jacksonville Jaguars face the Buffalo Bills in London on Sunday. The Bills are riding a three-game winning streak and are coming off a dominant 28-point win against the Miami Dolphins. Follow along as Yahoo Sports provides the latest news, scores and injuries as the Bills take on the Jaguars in London. CLICK HERE for all the latest from the Jaguars vs. Bills game in London and the rest of the NFL's Week 5 coverage. The game is set to kick off at 8 p.m. ET on Sunday, September 16. The Jaguars are currently 2-1 and the Bills are 2-2. The match-up is scheduled to take place at Wembley Stadium in London, England."}, {"Title": "'We're not allowed to talk to the males': Inside the Marines' tortured battle to integrate basic training by gender", "Url": "https://fortune.com/2023/10/08/marines-basic-training-gender-all-male-female-platoons-equality/", "Source": "Fortune", "Content": "Under a scorching sky at Marine Base Parris Island, two young recruits grapple awkwardly in hand-to-hand combat inside an Octagon training structure. Circling them, the drill instructor barks orders, “Hit her! Punch her! DO something!” Outside the ring, a mix of male and female Marine hopefuls are helping each other put on protective headgear, preparing for their turn at combat. They are assigned to one of the mixed-gender recruit companies as the Marine Corps moves gradually — and at times reluctantly — to more integrated training at boot camp. It’s been a bit hit-and-miss. While companies of men and women train together at the ring, on the obstacle course or at the range, the line of recruits outside the swimming pool presents a sharp contrast. There the companies are broken up into their smaller platoons that remain separated by gender. So as they line up, there is a small group of women standing rod-straight at the front with groups of men in formation behind them. It’s a stark visual reminder that Corps leaders still fervently believe there must be a degree of segregation as they mold young people into tomorrow’s force of what they promote as the Few, the Proud, the Marines. This summer — nearly eight years after the defense secretary at the time, Ash Carter, ordered all combat jobs open to women — the Marine Corps formally deactivated the 4th Marine Recruit Training Battalion at Parris Island. Since 1949, all female recruits have gone through boot camp at the South Carolina base; the 4th Battalion was created in 1986 as the women’s unit. The Marines have inched grudgingly toward integration. Marine leaders flatly opposed allowing women in combat jobs, but Carter dismissed their arguments. Many Corps officers stridently defended the training separation, insisting that women could grow more confident quickly if they were not directly competing with their often larger or stronger male counterparts. Under pressure from Congress, the Marines over the past four years gradually made the 4th Battalion coed, then disbanded it in June. The remaining recruit battalions include a mix of gender-integrated and all-male companies. Now, Marine leaders say, boot camp is integrated. But from watching the training for several days, it’s not that clear-cut. Inside the pool, men and women struggle side by side, jumping off a platform and swimming to the other end. Some wear their fatigues inside out, identifying them as Marines who are just learning to swim and flailing the length of the pool in a mix of dog paddle and haphazard overhand stroke. Instructors are also a mix of men and women, and they line the sides ready to toss a float or jump in if needed. But outside, a group of recruits moving through the woods and then dropping to crawl across a stretch of blistering hot sand are all men trying to get through the final tests to become a Marine. A second group on a different part of the course also includes no women. Brig. Gen. Walker Field, who heads the recruit depot, is insistent that keeping the platoons segregated by gender is key to the way the Corps makes Marines — by taking individuals, breaking them down and building them back up as team members. “We have established a tried-and-true manner by which we train Marines that proves effective in transforming young Americans,” he said in a recent interview at Parris Island. “We break down their individuality and grow them as a team. We’re adamant about that outcome. Having the platoon model is absolutely part of that.” He added that by 2024, training at Marine Recruit Depot San Diego on the West Coast will also be fully integrated. Female recruits will then be split evenly between the two locations. Field said keeping the platoons all one gender allows unit leaders to provide guidance and instruction tailored for each group when they are together in their barracks in the evenings. “Being the same gender at the platoon level allows us to optimize the training schedule every single day and every hour of the day,” he said. Some measure of all-male companies would be necessary no matter what because there just are not enough female recruits to go around. Of all the military services, the Corps has the smallest percentage of woman, hovering between 8% and 9%. Lt. Col. Aixa Dones and other female officers are also strong advocates of the continued segregation. “As someone who came through this battalion as a recruit and has worked here as a young company grade officer, I would advocate that there’s goodness to there being all-female platoons,” said Dones, who served as the last commander of the 4th Battalion before its shutdown this year. Speaking in the former battalion’s offices, now largely empty, she said she remembers being a young recruit, and “I can’t imagine it having gone any other way.” Noting that 17- and 18-year-olds are not too mature, she said they can easily get distracted by “liking and feelings and emotions.” She and others say keeping the men and women in separate platoons helps them stay focused and that changing to full integration could present problems. Out near the firing range, Sgt. Maria Torres, a drill instructor, is working on firearm basics with her all-female platoon. The company-level integration, she said, is necessary and a good start. But expanding it to the platoon level might have consequences, so “we’d have to start small.” But many disagree. They say the separate platoons only reinforce the stigma that the women are not considered equal and should be treated differently. Erin Kirk, a former Marine sergeant who went through the more segregated training in 2010, remembers the ridicule and the cat calls from male recruits who looked down on the women in the 4th Battalion. The split, she said, divided them into “male Marines” and “female Marines,” and that shaped the men’s view of the women and made it more difficult for them to work together as they moved along. “It made you feel like you weren’t part of the team. It made it difficult to be seen as a real Marine,” said Kirk, who served for five years. “Now we have the opportunity to have equity and inclusion and not be seen as an ‘other.'” Another female Marine officer — who is still on active duty and has served for more than 15 years — said her first surprise as a new recruit was when she was issued her uniform and realized it was not the same as the one her male recruiter had worn. Her uniform did not have the same collar and the hat was different. And when she got to Parris Island, “the first class I got was how to do my hair. We’re training to be the most lethal force and the first thing you learn is how to do my hair.” The officer spoke on condition of anonymity to avoid any repercussions because she is still in the Corps. Asked about those complaints, Dones disagreed that the segregation presented problems for the women. “Our female platoons have been outperforming our male teams, and we have had more female company honor graduates than we have had male,” she said. Young female recruits, who usually come from high schools where there is little separation, acknowledge the differences but voice no complaints. Nicole Momura, 22, said she chose the Marines because she thought it was the hardest military branch, and “this recruit was looking for something bigger than herself.” She shrugged off the platoon segregation, noting that “we’re all going to be working together in the fleet.” Nubia Delatorre, 19, said she is proud to be a member of the second female platoon in Bravo Company, but admits the men and women do not interact very much. “We’re not allowed to talk to the males,” she said. Taking a quick pause from her workout inside the gym, where she was recovering from a stress fracture of her hip, Delatorre said she believes they all get the same training. She said she joined the Marine Corps because “I wanted to prove to myself that I could do something hard.” © 2023 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions.", "Summary": "Since 1949, all female recruits have gone through boot camp at Parris Island. The 4th Battalion was created in 1986 as the women’s unit. Marine leaders flatly opposed allowing women in combat jobs, but Carter dismissed their arguments. Now, Marine leaders say, boot camp is integrated. But from watching the training for several days, it's not that clear-cut. The remaining recruit battalions include a mix of gender-integrated and all-male companies. It's a stark visual reminder that Corps leaders still fervently believe there must be a degree of segregation as they mold young people into tomorrow's force of what they promote as the Few, the Proud, the Marines. The Corps has the smallest percentage of all services, hovering between 8% and 9%."}]